[{"content":"\n## Intro\nLast week, I was still crunching numbers in financial models to evaluate investment opportunities, and now, I'm thousands of miles above the ground, on my way to San Diego to begin a software engineer internship at a crypto startup.\n\nLife had been dramatic these two years and things had developed so quickly that I still wonder if I'm in a dream. I have three hours left until arrival, so I would like to write this milestone post to reflect on what had happened in the past four years.\n\n*Note: the part about my journey on Wall Street was also [posted on WSO](https://www.wallstreetoasis.com/forum/job-search/break-into-wall-st-to-break-into-tech), an online forum for high-finance related topics.*\n\n## Beginner's Luck\nWhen I started my undergrad in finance, I was naive but ambitious. I wanted to be the Wolf of Wall Street, and the lure of a gilded lifestyle had intoxicated me to network with industry professionals non-stop as to get my foot in the door.\n\nCoutless cold emails were sent. After a sea of rejections and non-responses, I got an offer from a [Private Equity fund](https://pouschinecook.com/), where I spent my freshman summer. It was an incredible experience in terms of actually building out [Leveraged Buyout](https://www.investopedia.com/terms/l/leveragedbuyout.asp) [models](https://multipleexpansion.com/2018/04/23/easy-lbo/) for live deals, [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) with CEOs, lawyers, customers etc. On top of all, I learned the importance of communication and how to drizzle business conversations with American idioms.\n\nLeveraging the skills acquired that summer, I got into a large ($80B) [credit fund](https://www.hpspartners.com/en/home/) for a part-time internship. The brand-name worked very well for me to network with [elite boutiques](https://mergersandinquisitions.com/elite-boutique-investment-banks/). Everything was so smooth that I almost got a guaranteed internship at an EB for junior summer. Then, Covid came.\n\n## Survival Mode\nMy parents informed me that they could no longer support my study in the US financially. And I was facing a $50k overdue tuition. The financial stress destroyed my mental health, which led to absurdly terrible performances for interviews that I worked hard for two years to secure. And the EB that I almost got a guaranteed ticket for canceled their 2021 summer class recruiting process.\n\nThat's it. In those two or three months of year 2020, everything went away.\n\nOf course, during that time, recruiting was less a priority than the immense financial pressure I was facing. I could not go back to my home country because there's nothing left for me. My parents had sold the house and car to pay off debt they owed. The thought of giving up was haunting me on a daily basis.\n\nFate was a very interesting thing. A friend appeared just right before I almost broke down. He taught me how to run ecommerce stores. I was super lucky. The ecommerce business went very well -- I was making, at peak, $3k a day; and the stock market, well, was to the moon everyday so I started allocating free cash flows from the ecom biz to options trading.\n\nIt was a miracle that I paid off my tuition in less than half a year. But the cost was that I missed the most important recruiting cycle in high-finance. The ecommerce business was lucrative but it was very labor intensive: I had to carry and manage an inventory, taking photos of the goods, posting, packaging and shipping, dealing with unreasonable customers off-line. I quit as soon as I paid off my tuition.\n\nThen, I was like an aimless fruit fly for that year. I tried out a hedge fund internship, a VC internship, and settled with a small [special situations fund](https://www.c2.energy/) to conclude year 2020.\n\n\n## Break Into Tech\nAt this point, I've seen and done most of the things expected from junior level professionals, at least on the Private Equity side. I realized that what I enjoyed (modeling, writing investment memos) were just checking boxes. The value creation and winning bids had little to do with things I enjoyed. \n\nI also became quite frustrated by how inefficient Wall Street was. Like creating deal folders, finding files, creating due diligence trackers, Q&A logs, extracting schedules from exhibits of some legal documents that were poorly scanned, etc.. And hell, managing data rooms! I started picking up some Python and VBA to automate lots of the tedious works. And I enjoyed it.\n\nThat was year 2021. Tech was booming. My [high school friend](https://shumingxu.com/about), who's a Comp Sci major, told me that it's possible to transition into tech. I kind of just put that in the back of my head since I thought the chance for me was not that good because of my non-STEM major. But I kept [learning](https://www.xipu.li/posts/new-things-2021) and [building things](https://github.com/GoodluckH?tab=repositories) on the side, just for fun.\n\nFast forward to early this year, I joined the company I've been interning at full-time. It's kind of like a dream came true, working in private equity (although it's infrastructure investments) right out of college. I graduated December 2021, and joined the firm in Feb. However, during that one month interim, I got very interested in web3 -- everything from DeFi to writing Smart Contracts. \n\nThe more I built the more I loved tech, and the more faded passion for finance. When [my app](https://apps.apple.com/us/app/apple-store/id1594982631) got accepted by Apple to app store, I decided to make a bold move.\n\n## Start All Over Again\nIn late April, I started wondering \"why don't I get a tech internship for the summer?\" It was a daunting thought because the tech industry had been declining this year. [Layoffs](https://news.crunchbase.com/startups/tech-layoffs-2022/) and [hiring freezes](https://news.yahoo.com/tesla-apple-microsoft-peloton-all-of-tech-companies-hitting-the-brakes-on-hiring-202428628.html) were rampant in tech. The macro environment was so dire that I actually thought about delaying my breaking-into-tech plan. \n\nBut I realized that the time was against me. I was 23 already (since I re-did one year of high school when I came to the US), it's now or never. \n\nYes, I had to start everything from scratch again, while balancing a full-time finance job. Applying to internships on LinkedIn and AngelList became a second-nature. And I started to cold DM founders/CTOs on Twitter. During that searching period, I saw a fool in the mirror on a daily basis. I wondered why on earth I'm doing this. Oh, I also applied to master schools so I can get that CS degree for visa/immigration reasons.\n\nOnce I got accepted into a master school for a Computer Science program, I learned that my current work visa will be voided soon. So, I had a very tight timeline to find an internship. Otherwise, I'll be spending this summer doing nothing while having to bleed my savings to support a life in NYC. \n\nBig tech firms had already concluded their internship programs last fall. And the few small firms left mostly require Computer Science degrees or prior tech internship experiences. For a whole month straight, I applied to at least 300 internships (lots of them were posted over three months ago).  Didn't get a single response. Not even rejection emails.\n\nIt was mid May when I got interviews from three firms. One rejected me after two weeks. One had no response after the HR round. One was a SF based startup that pays very well (2k/week) for interns and for this one, I got the onsite (kinda like [superday](https://www.wallstreetprep.com/knowledge/superday/) in finance) invite after passing the technical round.\n\nI thought I was all set until two days before onsite, I was informed that they had canceled onsite. It's probably because of that [YC warning email](https://techcrunch.com/2022/05/19/yc-advises-founders-to-plan-for-the-worst/) since it's a YC startup that wants to practice financial disciplines.\n\nThree days after, the other startup (crypto) responded, and I was invited to a technical round with the founder.\n\nBut after that round, I heard nothing for another week. I checked their LinkedIn job post, that internship position had 900 applicants. And that they were only taking one intern. I thought I was probably a nobody comparing to those with CS degrees and impressive internship experiences.\n\nI was already making other plans for my summer when last Monday (May 30), the HR told me that I got the offer. \n\n\n## The New Chapter\n\nSince the intro of this post, I've started my internship at [Edge](https://edge.app/) for a few days. These few days, though, has been an eye-opening experience.\n\nI have observed so many differences between Wall Street and Silicon Valley. Starting with the vibe. The keyword for Wall Street is \"discretion\". Since many high-finance roles require interfacing with multiple external parties, strict dress codes and languages apply to professionals. You rarely see any high-finance professionals wearing a t-shirt to work. Professionalism is expected everywhere from the [font](https://www.wallstreetoasis.com/forum/off-topic/what-is-the-default-font-at-your-firm) you use for a presentation to the tone of a clarification email.\n\nBut on my first day stepping into the startup's office, I immediately notice the expressive vibe that epitomizes Silicon Valley. There are bikes and e-skateboards near the door, people wear all different kinds of clothes, even caps. Oh, there's also a dog! In today's lingo, the vibe is \"chill\". Even for external facing communications, nothing stops people from using emojis.\n\nAnother salient difference is about the mode of work. By that I mean, on Wall Street, trudging through back-to-back meetings can be your daily job. I've made friend with the Outlook reminder that pops up 15 minutes before a meeting. As a result, everyone's very busy because these meetings can be disruptive to workflows to start with, and to-do items get generated from meetings to add on your plate. In short, there's little predictability to what you will be working on before starting the day.\n\nWhile investment professionals live in their Outlook inboxes, software engineers reside in GitHub, where most of the coding works are being saved, reviewed and version-controlled. Aside from daily huddles and the weekly engineering meetings, my calendar is basically wide-open. And there's a clear sense of what to do everyday, so that predictability allows me to spend time on solving problems (well, that's basically what software engineers do).\n\nAlthough coding can be self-taught, I've learned so much high-tech knowledge (like [race conditions](https://en.wikipedia.org/wiki/Race_condition), [mutex](https://en.wikipedia.org/wiki/Mutual_exclusion), [Redux](https://redux.js.org/)'s [data flow](https://redux.js.org/tutorials/fundamentals/part-2-concepts-data-flow) logics, [runtime type checking](https://www.npmjs.com/package/cleaners), [future commits](https://github.com/EdgeApp/edge-conventions/blob/master/git/future-commit.md), and more!) in the past few days than I would otherwise learn by myself in months. I think this is a huge benefit of working in-person vs remote. I can just bounce off ideas immediately to engineers around me and ask them anything and get an instant response.\n\nThe learning curve ahead of me is very steep, but it will leapfrog my engineering skills. I always want to be a startup founder, so the easy access to founders at Edge becomes very valuable. I look forward to having a cerebral summer and writing another post to share what I learned.\n\nGoodbye Wall Street. \n\nHello, Silicon Valley.","data":{"title":"From Wall Street to Silicon Valley","draft":false,"publishedAt":"2022-06-11","summary":"A series of unexpected turns of life had brought me from New York back to the West Coast to pursue a career in Software Engineering.","author":"Xipu Li","image":"/images/from-wall-street-to-silicon-valley/edge-office-view.jpeg","coverImageCaption":"Office view from <a href=\"https://edge.app/\" target=\"_blank\" rel=\"noopener noreferrer\">Edge</a> in San Diego. Huge contrast to the forest of skyscrapers I was used to when working in Manhattan.","tags":["personal","learning","software engineering","milestone"]},"filePath":"from-wall-street-to-silicon-valley.mdx"},{"content":"\n# Label is bad\n\nWe often attach labels to other people, which is bad because it generalizes away any individuality, it secludes us from meaningful human interactions. But we also label ourselves, which secludes us from learning.\n\n\"I'm a lawyer, I'm not gonna try to crunch those numbers on Excel\", said a general councel in the Teams call. I think this mindset is incredibly dangerous, especially in an age where we let our job titles define who we are.\n\n# Common sense\n\ntruth can be counterintuitive. That means we cannot follow common senses that much. If we think in terms of common sense, then we will become commoners. Nothign bad about it, but if you crave success, commoner perhaps is not where you wnat to end up at.\n\nif you chase money, you won't get any.\nif you chase sex, you won;t get any.\n\n    maybe you will, but the journey will be much more difficult. We often see examples where people who don't care about somethign ended up getting the most of that something.\n\n    Someone who'se obsessed with playing minecraft with no interst in women ended up having the most sex.\n    some nerds who just want to solve a problem ended up create a multi-billion dollar company.\n","data":{"title":"Making a memorable life","draft":true,"publishedAt":"2022-01-16","summary":"A year of new experiences","author":"Xipu Li","image":"/images/new-things-2021/vail-mountain-view.jpeg","coverImageCaption":"Credit is all <a href=\"https://www.linkedin.com/in/li-w-190868105/\" target=\"_blank\" rel=\"noopener noreferrer\">Frank's</a>","tags":["personal","learning"]},"filePath":"labels.mdx"},{"content":"\n## Breaking into tech (Jan - Oct)\n\nYear 2021 felt like an uneventful weekend given the backdrop of how much had occurred in 2020. However, I had officially made an [inroad](https://github.com/GoodluckH) into tech as I had spent most of my first-half of the year on learning the fundamentals like [algorithms](https://cs61a.org/) and [data structures](https://github.com/GoodluckH/learn/tree/main/Computer%20Science/Data%20Structures%20and%20Algorithms). I'm very grateful for having a part-time internship that had left me with ample amount of time to dig into these computer science concepts while able to earn a living in Manhattan.\n\nOnce grasped foundamental concepts, I started to seeing the world differently. Many things we take for granted &mdash; like the traffic control, social media apps, websites, etc. &mdash; started to appear glamorous to me. I marveled at how smart human beings are, how we are able to come up with powerful abstractions like [trees](<https://en.wikipedia.org/wiki/Tree_(data_structure)>), [graphs](<https://en.wikipedia.org/wiki/Graph_(abstract_data_type)>), [lists](<https://en.wikipedia.org/wiki/List_(abstract_data_type)>), and so on, to represent and build our world.\n\nAlthough there is a copious amount of resources online, many are of low-quality or contain fragmented concepts. I was lucky to avoid wasting time on those hours-long YouTube videos that most uninformed beginners would start with. Thanks to [a high-school friend](https://shumingxu.com/) who now attends UC Berkeley, I was able to get a high-quality self-study curriculum that was ridiculously simple:\n\n1. [CS61a](https://cs61a.org/): an introductory course on programming offered by UC Berkeley\n2. Algorithms ([Part I](https://www.coursera.org/learn/algorithms-part1), [Part II](https://www.coursera.org/learn/algorithms-part2)): coursera courses designed and taught by [Kevin Wayne](https://www.cs.princeton.edu/people/profile/wayne) and [Robert Sedgewick](https://www.cs.princeton.edu/~rs/) of Princeton University\n\nAll of these resources are available to the public and free-of-charge, which makes me regret about picking finance as my undergrad major (the ROI and the utility are just subpar). High quality learning should involve [robust and frequent tests](https://www.scientificamerican.com/article/researchers-find-that-frequent-tests-can-boost-learning/), and I benefitted a lot from the challenging tests and projects designed by best-in-class professors in the field.\n\nTo work in tech as a software engineer, I would have to obtain a degree in Computer Science or related fields due to my visa status. Meaning, there is a good chance that I will be attending a grad school. As a non-CS major, I face a very limited choice when selecting schools. Currently, I have submitted my application for University of Washington, and in the process with Northeastern and Brandeis. From what I learned, grinding LeetCode seems to be more important than the prestige of the school. So, I optimized for location and affordability.\n\nAfter drafting a list of potential schools, I started planning for something that I thought I would never have to touch again in my life: the standardized test.\n\nPreping GRE was quite an experience. It refreshed my understanding on foundamental math concepts, but more importantly, it taught me how to engage in critical thinking. Within the reading section, there are logical inference questions like \"_Which of the following is an assumption on which the argument depends?_\", or\n\"_The argument is most vulnerable to criticism on the grounds that it fails to consider the possibility that..._\". Answering lots of these questions had left a mark in my mind. I found that most reading sources online are either biased or outright misinforming. By simply asking what assumptions the claim is based on is a worthwhile mental exercise to help gain clarity and stay objective.\n\nI'm still learning and breaking into tech, but so far, I've been very much fascinated by the power of technology and excited to see how emerging tech like blockchains can transform and empower individuals. [It's time to build](https://future.a16z.com/its-time-to-build/)!\n\n## Trip to California (Nov)\n\nI went to [Bishop O'Dowd](https://www.bishopodowd.org/) for high school and naturally, a good amount of my friends stayed in Cali in pursuit of computer science related majors. It had been more than three years since the last time I visited California, so I decided to take advantage of the Thanksgiving break to pay a visit.\n\nWith a duffle bag and a backpack, I hopped on a Uber. Destination JFK. Once I passed the security check, I kinda just walked into the plane as there was no line at the terminal. I later found out that the gate was supposed to be closed 15 minutes before departure but since I hadn't taken a flight for so long, I thought I was early by being there 5 minutes before the departure time &mdash; I had certainly taken so many subways. In other words, I almost missed my flight but because I was not aware of the urgency, the whole process felt was personally tailored.\n\nThe next I knew was me, three-hour younger, bathing in the San Francisco sunlight.\n\nCalifornia had a unique vibe. There's no exhaustive way to describe it, but many things were of stark contrast to that of New York. The foremost difference was how Uber drivers were so talkative in San Francisco, whereas their New York counterparts were more taciturn. Another difference was obviously the weather. I took the photo below when I was in high school, but didn't start appreciating the picturesque view until after having lived in New York's concrete jungle for a while.\n\n<BlogImg\n  src=\"/images/new-things-2021/hills.jpg\"\n  alt=\"Marin Headlands picture\"\n  width={120}\n  height={60}\n  objectFit=\"cover\"\n  caption=\"The pic was taken on the Baker Beach. The landscape should be Marin Headlands.\"\n/>\n\nI had a great catch-up with the Berkeley friend mentioned before. We grabbed [pizza](https://www.sliverpizzeria.com/), enjoyed [boba](https://www.instagram.com/hayteaca/?hl=en), and talked hours about everything from what's up with our high school teachers and friends to investing strategies.\n\nNext day was Thanksgiving, and knowing I came to SF alone, a co-worker at my [current company](https://www.edpr.com/north-america/) invited me for a family dinner (Thank you Louis!). The most memorable thing was when kids asked what superpower they should have, a girl answered \"hugging\", which resulted in kids running around the house hugging everyone. Very wholesome!\n\nThe care-free vibe, the weather, the hospitality, and the tech scene finally convinced me to go back to California in the future.\n\n## Things learned from the ski trip (Jan 2022)\n\nA whimsical call to my friend Frank led to an excursion to Vermont. Up until then, I hadn't engaged in any outdoor sport since I moved to New York in 2018.\n\nAt Penn Station, Frank, Tom and I convened. We took a train to a parking lot in Long Island to pick up the car, and then drove into a very large boat that could accomodate vehicles. We offboarded in Connecticut and took a break at a Domino's in Massachusetts. Two slices of pizza and three chicken wings later, I learned that Tom and Frank were working on [a startup idea](https://www.etroduce.net/) that sounded quite interesting. The remainder of the drive to hotel, therefore, was dedicated to an intensive conversation about growth strategies, margin projections, and how to pitch the idea to VCs.\n\n<br />\n<ExpandableCard \n    title=\"More on their startup idea\"\n> \nBasically, they thought the rental market was inefficient as brokers get paid handsomely (usually a month of rent) by just showing potential renters around the apartment. Instead, they were trying rebate a portion of that commission back to renters. So, if I decide to rent a studio for $2,000 a month, then I will get, say, $500 back from their startup. Two founders were thinking about hiring agents on a full-time basis and paying a generous, albeit fixed, salary instead of commissions. They were also envisioning a one-stop shop where people who are poor on paper can get a guarantor service to fulfill property owners' requirements.\n\n<br />\n\nThis would be a heavy operating leverage with which the profit margin scales dramatically with revenue growth. Evidently, the hardest part is to ramp up the business to hit that critical mass point. I hope by publicizing their ambition through this blog, Tom and Frank can get an extra boost of motivation.\n\n</ExpandableCard>\n\n<br />\n\nNext day, we arrived at [Okemo Ski Resort](https://www.okemo.com/). And the fun began! As a total beginner equipped with overweight cheap rental gears, I could not possibly enjoy this sport without Tom's patient training. With over a decade of experience, Tom was an expert skier who could do things like spinning and dancing down a [black trail](https://www.skiclub.co.uk/info-and-advice/before-you-go/how-to-read-a-piste-map) or ski on one leg &mdash; all without wearing a helmet.\n\n<BlogImg\n  src=\"/images/new-things-2021/ski-mountain-top.jpeg\"\n  alt=\"Me in ski gears. Smiling.\"\n  width={120}\n  height={100}\n  objectFit=\"contain\"\n  caption=\"There's a black trail behind. The smile was forced.\"\n/>\n\nWith Tom's robust training, I was on a lift to [a green trail](https://www.trailforks.com/trails/expresso-409525/) on the second day. Everything was enjoyable until I suddenly face an intimidatingly steep slope. I could barely [pizza](https://en.wikipedia.org/wiki/Snowplough_turn) well, so the slope looked a suicide mission to me. I was paralyzed with my mind envisioning all the epic falls that could happen to me. My legs were shaking. Every cell in my body was in survival mode. Fear took over.\n\nI ended up stood there for quite a while. I tried to postpone the inevitable by telling myself \"I will go once there were fewer people\". But there was a constant stream of people breezing past me. \"There will always be people\", Tom said, \"the only way to go is down. If you fall, you fall.\"\n\nI did fall, multiple times. But Tom's words sank in. If you fall, you fall. Our fears and worries are what prevent us from achieving amazing things in life. But life has taught me that the things we fear and worry either 1) did not happen, or 2) happened to us but we've already gotten over with them.\n\nAnother thing I learned from skiing was that going too fast can result in dramatic failures. When I just started, I didn't know how to stop, so I dashed down steep slopes like a bullet &mdash; into the woods. The lesson applies beyond skiing. According to [a podcast](https://open.spotify.com/episode/3roDdtLjzduKgLDG0Y8CD9), one of the major reasons why startups fail was that they grow too fast to maintain control.\n\nNow I can do black trails without fears (still with falls, though), and I intend to ski as many times a month as possible. So if you are into skiing, definitely hit me up!\n\n## Inspirations (Jan 2022)\n\nEarly in Jan, 2022, I stumbled upon [Nathan Leung's blog](https://www.natecation.com/) on [how to become an accredited investor](https://www.natecation.com/accredited-investor-investing-startups-series-65/). I thought he was a finance-major but as I explored more of his posts, a new world just opened up to me.\n\nThere are so many talented college students in the startup game! I was amazed by the things they are building and lifestyles that would be considered as odd in New York. Somehow, I felt a sense of belonging. That had motivated me to learn more and build more.\n\nOne thing I learned from reading Nathan's blog was his strong networking skills. This year, I strive to walk out of my comfort zone and meet more people in the startup field. And that's one of the reasons [why](https://www.julian.com/guide/write/intro#:~:text=3-,Human%20connection,-The%20most%20efficient) I was motivated to start this blog to share my journey and updates with my network.\n\nI will start my full-time job in Feb 2 in New York but always willing to meet and chat. Feel free to drop me a note via [email](mailto:xli347-contact@fordham.edu) or a DM on [Twitter](https://twitter.com/theXipuLi). I hope you stay safe and healthy and wish you a wonderful new year ahead!\n","data":{"title":"New Things Learned in 2021","draft":false,"publishedAt":"2022-01-16","summary":"An uneventful year full of trying out new things and learning opportunities","author":"Xipu Li","image":"/images/new-things-2021/vail-mountain-view.jpeg","coverImageCaption":"Credit is all <a href=\"https://www.linkedin.com/in/li-w-190868105/\" target=\"_blank\" rel=\"noopener noreferrer\">Frank's</a>","tags":["personal","learning"]},"filePath":"new-things-2021.mdx"}]